driver-tests/pojose/fault/caFaultTest/test/testFaultUsingUtil/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sim="http://j2ee.netbeans.org/wsdl/caFaultTest/SimpleRPCLiteral">
  <soapenv:Body>
    <sim:SimpleRPCLiteralOperation>
      <part1>ThrowFaultUsingUtilMethod</part1>
    </sim:SimpleRPCLiteralOperation>
  </soapenv:Body>
</soapenv:Envelope>