driver-tests/pojose/fault/caFaultTest/src/jbiasa/wsdls/SimpleRPCLitFaultMsg.xml

<SOAP_IN-OUT>
    
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sim="http://j2ee.netbeans.org/wsdl/caFaultTest/SimpleRPCLiteral">
   <soapenv:Header/>
   <soapenv:Body>
      <sim:SimpleRPCLiteralOperation>
         <part1>ThrowFault</part1>
      </sim:SimpleRPCLiteralOperation>
   </soapenv:Body>
</soapenv:Envelope>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <S:Fault xmlns:ns4="http://www.w3.org/2003/05/soap-envelope">
         <faultcode>S:Server</faultcode>
         <faultstring>testFault</faultstring>
         <detail>
            <ns2:theFault xmlns:ns2="http://j2ee.netbeans.org/wsdl/caFaultTest/SimpleRPCLiteral">
               <appMsg>appMessage is appmessage</appMsg>
            </ns2:theFault>
         </detail>
      </S:Fault>
   </S:Body>
</S:Envelope>

</SOAP_IN-OUT>
